Revit 2027 API
ParameterTypeId.RbsCurveDiameterParam Property
 "Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsCurveDiameterParam { get; }
Public Shared ReadOnly Property RbsCurveDiameterParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsCurveDiameterParam {
	ForgeTypeId^ get ();
}
static member RbsCurveDiameterParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace